---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinShapen1
source: html/c4038bc6-cd33-adcc-b300-7ddee9ef2ce5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinShapen1 Property

"Primary Bar - Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinShapen1 { get; }
```